---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData.NumberOfPhases
source: html/1e6211dd-dde5-39c5-563c-4967431190a9.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData.NumberOfPhases Property

The number of phases.

## Syntax (C#)
```csharp
public int NumberOfPhases { get; }
```